load-test/load-test.yml
config:
  target: "https://www.nextcv.in"

  phases:
    - duration: 120
      arrivalRate: 7
      rampTo: 10
      name: "Ramp Up"
    - duration: 300
      arrivalRate: 20
      name: "Sustain Peak"
    - duration: 120
      arrivalRate: 10
      rampTo: 7
      name: "Ramp Down"

  defaults:
    headers:
      Content-Type: "application/json"
    Cookie: "__Secure-next-auth.session-token=eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..VDCKM6AzHwAMgSjb.VZuWmdIqadX6xBTRPJS44m5m997C-8y1bpBDDfutHQws_hlJhsiCsf6uZlj_PriVRvQ5wFESVDGPOTJ2T-S7qRcRUT47gEFIr9X5uqI-bLWNh9-H5fmP1vWNJiuwBCxhOVrwyxhA3YJ8pBb6cVmUPdRZesc6N5hSfQTYBwpPQp9IEcTPN_K2COHSbZUqPE6qrVtYYdlS05lVbkpEX49bplHfjOCrcgkBOGXAuSzsqP8lmLHzMW-Oxzi6J3AkvTS8MD5TpkUd7Y74mNFCKXG21W1bvjOp9MiezZ8_X3gBGH1uAgaEuDrbHa8wPEHiFxSSPh4d8Yl5hCkqAF6vIyFdtNwlmrm4gnFQVJCgNRD1kUia20-DLXwreln_ruxeLorz9X1EWCC_zH2DyARJKVfQeP8a6oVjTjswezcGa_EA67NORgxRib1JnTlDxc-gnmoGTU1SGIcP9XDg0BodbN-Kahea2vEoLmio0KiqXCCqxTwgeEzKx0HEKCu9E8eADrc5pldhNmDDpthrr2UoT8lWS1SdHp6oR1QOeXT9b8orkEeLkFwWX_InqP4yFJ84hsgNldfB460lOlawenUxjm82g43OW6wwybYR9VHBb0ug54oLignmziL_czSiBgFQSSnxJUF6S3nYoUujldkpSJcIBEILQzvBDWs6x6-3GhMf96F5j3hdP5j3hfxMpmeowL9fIPfpbv6thEWtuiZKdPAmYwo_XmYGTlGis3BAOJDkG53-kxRxxBWpb8Q0izB0vypAEbr8VzSziIK2NOVMhfdXO4ue7IWJfX6TiixyPMIgGGu_MIwtOx-s8mSWtHybtGunl7n4AkJ_y6WcVgsOrNSdlAIHKM5eP9SvrUbZaX0B8-gHvF8U6FxT3WRbBeeh6SUP5pHKBuyvis3Jruy33Ww37JwbVKDZsTPwp_7_ILcyP2sD_tKkfxD1ojIcHy3kD6CZ2-ryvi0-9VS75p2rtGca-5Xs3JJnYcg3Pi3zu0VSqctrgLwLXvqhkYJQAavv1a-oxrdEY0aImxNNzKYr9d99ZZmd5oe9SC1CjeHgA402gqch9p0tMX36NlUmrSqswvmH6euK61rqgQh2OgC02UfEJXhGeruofG0BqY7NdI-stfOROdBpgii36Nj6xp4-2qGwaRJpFny98wYzcCGzls25KpCqQpLI2bRRK1kEpclSsk1534sYNtM6AVtmcrd-ryy6xmL5MNXuyqT7Jtji5H70n018N2XUL_cx6RYUuMB3Og0qwE97217TnL5IdpkzlsjoeWuS3K_dRXxXONqjYHe-w7gftk0RjIPZeTqgs2VQfTvPn5kW1AVQCtaQbGDS4P0yP1IIhYG08oLpG9DQXrQcI-kh-p9W7yKi0xUiRP-P8g9WxMRTDLITWpBwRtP1iLQ.5xAQQbs3_dMjXrHClhII9w" plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  - name: "Authenticated User Journey (Google Login)"
    weight: 70
    flow:
      - function: "generateResumeData"

      - post:
          url: "/api/resume/savedraft"
          json: "{{ resumeData }}"
          expect:
            - statusCode: 201

      - get:
          url: "/api/resume/getAllResume"
          expect:
            - statusCode: 200
          capture:
            - json: "$.data.resumedata[0]._id"
              as: "resumeId"

      - post:
          url: "/api/gen/aiResume"
          json:
            resumeData: "{{ resumeData }}"
          expect:
            - statusCode: 200
          think: 2

      - post:
          url: "/api/resume/update/{{ resumeId }}"
          ifTrue: "resumeId"
          json: "{{ resumeData }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/resume/getResumeById/{{ resumeId }}"
          ifTrue: "resumeId"
          expect:
            - statusCode: 200

  - name: "Anonymous Traffic"
    weight: 30
    flow:
      - get:
          url: "/api/healthcheck"
          expect:
            - statusCode: 200