load-test/load-test.yml
config:
  target: "https://www.nextcv.in"

  phases:
    - duration: 120
      arrivalRate: 2
      rampTo: 10
      name: "Ramp Up"
    - duration: 300
      arrivalRate: 10
      name: "Sustain Peak"
    - duration: 120
      arrivalRate: 10
      rampTo: 2
      name: "Ramp Down"

  defaults:
    headers:
      Content-Type: "application/json"
      Cookie: >
        next-auth.session-token=eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..dp7xVKGN8Td0jmKl.VgS4LmsZfvbstIV5JGYvCdf82New02ClPHLP6_UGnyIzPyLXYQsS5AtXI8a-rVn5edOp5bnOA623ZSy2CpspVaQe8-Sb9yix7oBwP7dr3MfzTBxcAmqL2JLh06nCTi4LqHD4uzh6gXZQCELwrytaxOVw2_yyZyQvgfn9FRNIz8KjLGT98F_ztumBvMnLlTN6Y0F540i9kiRKoXufuOZ9gViRPYRTXICcnKCghF7yTNVKfDgL58tCkCoYBMQEFHhLTmaHBoBA1k83SSNoVjcMcte2eUz8yLmhYFVjXf7sRDYCOksCfxsGKMlZGpVN5tbYhGtDXIrDMWqt2fHDWvP1djSTeGdZVSABmsI9U6nimm6_ow4_R98cW1vJ6nQ_PFd-6BbI5U_petn1NikLIl-0dhtAZ0iWLwaIgHKx-xB1OA9jY_BolQj5wbMwLRn7RGLLchr-N-fGei8UBdSARLkrrYUzgWX-kPLm4cm7ieZEs-0xD2DPYns7UnITfexa-gUjk5YLoO2S9rI-7xNpn4VKdK9QUY5bg1mZvfYzsH1W9D9UIF6SwfeaLhHU3Tn7QoD12gR20YobWDtA8xTxf4Va-cMuxeaq5cB_Bs1Uq4s61bx8GIXZ4CuwDyyLfRWShd7YXGreq_H9D0Bldv7p2jR6rGn688Qw0u0bKG9hFb6DFBpvKWtIhWcoyAypxFpZDsFDROPnnKBpzIIPNGUb61y55Jj6HsElMKAggjC6JTcgkHFEfoirwz3SBYwvdhVStippMxVZij1NYGd62HPUgXnIfqD7TnZNq2A7A2c2AoER5pyWu_yplPeq0T1ildpuvRk-UdsIy27ZwTAJy_cUeiljkQKywjSOrGKuUxh87n49ysmTqhraJPaFiK_aeZV_Tlbs9OLwQLtgV9EX8pgNljWkoyIvZomuPjgliMZlf9BMF5PQ1InM7bYgMs6V5B2Nmruyt-ajxwcUOEpx5tVD3cox42035Qx6uP-X14AdQDymVc8m-R2x0aDPAOig0IckK7RXHpxaRdOut3qDWhyp_HLgT2bHucHRr7i5VSNTmxJ3gUaLZE2XvmNifEU049v_vfQEVojVhZPFLrqs_a3C0vHtQw7eu_41DXgqeI0EGSyD4jJN2nyvy6K3Ekq0XSBAgZXDCQsNSfAUJQPYzbFb-LNIM-sHULRn4EA83IZb4d_pBppKl85cxbMe01l_-GfXco9tzZA_sxjc7oKNbbzsb8_IwvKgY7VP83DRSzO8SPpa7GXg53vLCj3PKEh9a4tAqumJ-3XrvpC5V4TjeL8sQF2RQ6jyOSDgvEORavS5ELQzzIK_Tl6KGsU5JNqOM8TLYFUeXTMV63Tagx2GFaacJGjN5gyJNXQGSA-5cu5R5VQsICx93Z_e7AsNPW-J3xo93sA.2ngpcZUoygaamn8_Juw9JQ

  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  - name: "Authenticated User Journey (Google Login)"
    weight: 70
    flow:
      - function: "generateResumeData"

      - post:
          url: "/api/resume/savedraft"
          json: "{{ resumeData }}"
          expect:
            - statusCode: 201

      - get:
          url: "/api/resume/getAllResume"
          expect:
            - statusCode: 200
          capture:
            - json: "$.data.resumedata[0]._id"
              as: "resumeId"

      - post:
          url: "/api/gen/aiResume"
          json:
            resumeData: "{{ resumeData }}"
          expect:
            - statusCode: 200
          think: 2

      - post:
          url: "/api/resume/update/{{ resumeId }}"
          ifTrue: "resumeId"
          json: "{{ resumeData }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/resume/getResumeById/{{ resumeId }}"
          ifTrue: "resumeId"
          expect:
            - statusCode: 200

  - name: "Anonymous Traffic"
    weight: 30
    flow:
      - get:
          url: "/api/healthcheck"
          expect:
            - statusCode: 200